Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: An object representing a dynamic, unordered, uniquing collection, for use instead of a Set variable in cases that require reference semantics.
ja: 動的な、順序なしの、特有なコレクションを表しているオブジェクト、参照意味論を必要とする場合にSet変数の代わりに使うため。

source: An object representing a fixed set of Unicode character values that bridges to a Character Set; use NSCharacter Set when you need reference semantics or other Foundation-specific behavior.
ja: ユニコード文字値の固定集合を表しているオブジェクト、それはCharacter Setにブリッジします；NSCharacter Setをあなたが参照意味論または他のFoundation特有の挙動を必要とする場合に使ってください。

source: An object representing a graphics coordinate transformation that bridges to Affine Transform; use NSAffine Transform when you need reference semantics or other Foundation-specific behavior.
ja: 画像座標変換を表しているオブジェクト、それはAffine Transformにブリッジされます；NSAffine Transformをあなたが参照意味論または他のFoundation特有の挙動を必要とする場合は使ってください。

source: An object representing a mutable collection of unique integer values that bridges to Index Set; use NSMutable Index Set when you need reference semantics or other Foundation-specific behavior.
ja: 特有な整数値の可変コレクションを表しているオブジェクト、それはIndex Setにブリッジします；NSMutable Index Setをあなたが参照意味論または他のFoundation特有の挙動を必要とする場合に使ってください。

source: An object representing a mutable set of Unicode character values that bridges to Character Set; use NSMutable Character Set when you need reference semantics or other Foundation-specific behavior.
ja: ユニコード文字値の可変集合を表しているオブジェクト、それはCharacter Setにブリッジします；NSMutable Character Setをあなたが参照意味論または他のFoundation特有の挙動を必要とする場合に使ってください。

source: An object representing a static collection of key-value pairs, for use instead of a Dictionary constant in cases that require reference semantics.
ja: キー値ペアからなる静的なコレクションを表しているオブジェクト、参照意味論を必要とする場合にDictionary定数の代わりに使うため。

source: An object representing a static ordered collection, for use instead of an Array constant in cases that require reference semantics.
ja: 静的な順序付きコレクションを表しているオブジェクト、参照意味論を必要とする場合にArray定数の代わりに使うため。

source: An object representing a static, unordered, uniquing collection, for use instead of a Set constant in cases that require reference semantics.
ja: 静的な、順序なしの、特有なコレクションを表しているオブジェクト、参照意味論を必要とする場合にSet定数の代わりに使うため。

source: An object representing a subprocess of the current process.
ja: 現在のプロセスの下位プロセスを表しているオブジェクト。

source: An object representing an immutable collection of unique integer values that bridges to Index Set; use NSIndex Set when you need reference semantics or other Foundation-specific behavior.
ja: 特有な整数値の不変コレクションを表しているオブジェクト、それはIndex Setにブリッジします；NSIndex Setをあなたが参照意味論または他のFoundation特有の挙動を必要とする場合に使ってください。

source: An object representing the bezier path to be used in the transformation.
ja: 変換で使われることになるベジェパスを表しているオブジェクト。

source: An object representing the span of time between two dates that bridges to Date Interval; use NSDate Interval when you need reference semantics or other Foundation-specific behavior.
ja: Date Intervalにブリッジする２つの日付の間の時間の開きを表しているオブジェクト；あなたが参照意味論や他のFoundation特有の挙動を必要とする場合にNSDate Intervalを使ってください。

source: An object specifier for the container objects for which to obtain the indices.
ja: インデックスを入手するコンテナオブジェクトのためのオブジェクト指定子。

source: An object specifier to be evaluated.
ja: 評価されるオブジェクト指定子。

source: An object that calls this method must also eventually call either the remove Observer(_: for Key Path:) or remove Observer(_: for Key Path: context:) method to unregister the observer when participating in KVO.
ja: このメソッドを呼び出すオブジェクトはまた、最後にはremove Observer(_: for Key Path:)またはremove Observer(_: for Key Path: context:)メソッドのどちらかを呼び出して、KVOに参加している場合はオブザーバーを登録解除します。

source: An object that converts between JSON and the equivalent Foundation objects.
ja: JSONと同等のFoundationオブジェクト間で変換するオブジェクト。

source: An object that converts between a property list and one of several serialized representations.
ja: あるプロパティ・リストといくつかのシリアライズされた表現の１つの間で変換するオブジェクト。

source: An object that coordinates the reading and writing of files and directories among file presenters.
ja: ファイルプレゼンタの間でファイルと辞書の読み込みと書き出しを調整するオブジェクト。

source: An object that decodes instances of a data type from JSON objects.
ja: あるデータ型のインスタンスをJSONオブジェクトからデコードするオブジェクト。

source: An object that decodes instances of data types from a property list.
ja: いくつかのデータ型のインスタンスをプロパティ・リストからデコードするオブジェクト。

source: An object that encodes instances of a data type as JSON objects.
ja: あるデータ型のインスタンスをJSONオブジェクトとしてエンコードするオブジェクト。

source: An object that encodes instances of data types to a property list.
ja: いくつかのデータ型のインスタンスをプロパティ・リストにエンコードするオブジェクト。

source: An object that executes AppleScript scripts.
ja: AppleScriptスクリプトを執行するオブジェクト。

source: An object that executes Automator workflows.
ja: Automatorワークフローを実行するオブジェクト。

source: An object that executes scripts.
ja: スクリプトを実行するオブジェクト。

source: An object that executes unix applications.
ja: unixアプリケーションを実行するオブジェクト。

source: An object that logs an assertion to the console.
ja: コンソールにアサーションを記録するオブジェクト。

source: An object that maps URL requests to cached response objects.
ja: URLリクエストをキャッシュされた応答オブジェクトにマップします。

source: An object that provides a convenient interface to the contents of the file system.
ja: 便利なインターフェイスをファイルシステムの内容に提供するオブジェクト。

source: An object that provides the ability to load, compile, and execute scripts.
ja: スクリプトをロード、コンパイル、そして実行する能力を提供するオブジェクト。

source: An object that represents a special condition that interrupts the normal flow of program execution.
ja: プログラム実行の通常の流れを妨げる特別な条件を表すオブジェクト。

source: An object that represents an HTTP cookie.
ja: HTTPクッキーを表すオブジェクト。

source: An object that specifies a date or time in terms of calendar units that bridges to Date Components; use NSDate Components when you need reference semantics or other Foundation-specific behavior.
ja: Date Componentsにブリッジするカレンダー単位の観点から日付または時間を指定するオブジェクト；あなたが参照意味論や他のFoundation特有の挙動を必要とする場合にNSDate Componentsを使ってください。

source: An object-oriented wrapper for a file descriptor.
ja: ファイル記述子のためのオブジェクト指向のラッパー。

source: An object.
ja: １つのオブジェクト。

source: An occurrence of textual content found during the analysis of a block of text, such as when matching a regular expression.
ja: あるテキストの塊の分析の間に、例えばある正規表現のマッチングの時に、見つけられたテキスト内容の存在。

source: An opaque token that represents the current user’s iCloud identity.
ja: 現在のユーザのiCloud身元を表す不透明なトークン。

source: An operation that manages the concurrent execution of one or more blocks.
ja: ひとつ以上のブロックの並列実行を管理するある演算。

source: An option set.
ja: あるオプションセット。

source: An optional dictionary of user information.
ja: ユーザ情報からなる任意の辞書。

source: An ordered list of preferred localizations contained in the bundle.
ja: バンドルの中に含まれる優先ローカライゼーションの順番付けられたリスト。

source: An ordered, random-access collection.
ja: 順序付けられた、無作為アクセスのコレクション。

source: An out value that returns any error encountered during initialization.
ja: 初期化の間に遭遇されるどんなエラーでも返す問題が起こったときの値。

source: An output parameter.
ja: 出力パラメータ。

source: An unordered collection of unique elements.
ja: 特有な要素の順番付けられないコレクションを作成します。

source: An unsigned integer that can be used as a hash table address.
ja: ハッシュテーブルアドレスとして使われることができる符号なし整数。

source: An view of the contents of an IndexSet, organized by range.
ja: IndexSetの内容のビュー、範囲によって組織化されます。

source: Analyzes the array and returns a “hint” that speeds the sorting of the array when the hint is supplied to sorted Array(_: context: hint:).
ja: 配列を分析して「ヒント」を返します、それは、そのヒントがsorted Array(_: context: hint:)に提供される場合この配列のソートをはかどらせるものです。

source: Another valid index of the collection.
ja: コレクションの別の有効なインデックス。

source: Another value to compare.
ja: もう一方の比較する値。

source: Any changes to property values caused by executing the script do not persist.
ja: スクリプトの実行によって引き起こされるプロパティ値へのどんな変更も、持続しません。

source: Any executable can use a bundle object to locate resources, either inside an app’s bundle or in a known bundle located elsewhere.
ja: 何らかの実行可能ファイルは、バンドルオブジェクトを使ってリソースを捜し出すことが、アプリの持つバンドル内部でまたはどこか他に位置する既知のバンドルの中でのどちらでも可能です。

source: Any object interested in receiving this data asynchronously must add itself as an observer of NSFile Handle Read To End Of File Completion.
ja: 非同期にこのデータを受け取ることに興味を持っているあらゆるオブジェクトは、それ自身をNSFile Handle Read To End Of File Completionのオブザーバとして追加しなければなりません。

source: Any object interested in receiving this data asynchronously must add itself as an observer of read Completion Notification.
ja: 非同期にこのデータを受け取ることに興味を持っているあらゆるオブジェクトは、それ自身をread Completion Notificationのオブザーバとして追加しなければなりません。

source: Any pathname within the mounted file system.
ja: マウントされたファイルシステム内部の何らかのパス名。

source: Any subsequent descriptors are used to further refine sorting of objects with duplicate values.
ja: あらゆる下位シーケンス記述子は、まったく同じ値を持ついくつかのオブジェクトのソートをさらに進んで改良するために使われます。

source: Any type whose properties are codable automatically conforms to Codable just by declaring that conformance.
ja: それらのプロパティがコード化可能なあらゆる型は、単にその準拠を宣言することによって自動的にCodableに準拠します。

source: Anything outside this range is an error.
ja: この範囲の外側のどんなものもエラーとなります。

source: App Extension Support
ja: アプリ拡張サポート

source: App Groups in iOS
ja: iOSでのアプリグループ

source: App Groups in macOS
ja: macOSでのアプリグループ

source: App Preferences
ja: アプリ環境設定

source: App Sandbox does not restrict which path values may be passed to this parameter.
ja: アプリサンドボックスは、どのパス値がこのパラメータに渡されてよいかを制限しません。

source: App Support
ja: アプリサポート

source: Append a buffer of bytes to the data.
ja: あるバッファのバイトをデータに加えます。

source: Appends a single element to this index path as a new node.
ja: 単一の要素をこのインデックスパスに新しいノードとして加えます。

source: Appends an array of elements to this index path as additional nodes.
ja: 要素からなる配列をこのインデックスパスに追加のノードとして加えます。

source: Appends the bytes in the specified array to the end of the data.
ja: 指定された配列の中のバイトをデータの終わりに加えます。

source: Appends the elements of another index path to this index path.
ja: 別のインデックスパスの要素をこのインデックスパスに加えます。

source: Appends the nodes of another index path to this one.
ja: 別のインデックスパスのノードをこのものに加えます。

source: Appends the receiver’s matrix to the current transformation matrix stored in the current graphics context, replacing the current transformation matrix with the result.
ja: レシーバの持つ行列を、現在のグラフィックコンテキストにおいて格納される現在の変換行列に付け加えて、現在の変換行列をその結果で置き換えます。

source: Appends the specified bytes from memory to the end of the data.
ja: 指定されたバイトをメモリからデータの終わりに加えます。

source: Appends the specified data to the end of this data.
ja: 指定されたデータをこのデータの終わりに加えます。

source: Appends the specified matrix to the receiver’s matrix.
ja: 指定された行列をレシーバの持つ行列に加えます。

source: Apple Event Handling
ja: アップルイベント処理

source: Apple event data types are defined in Apple Event Manager.
ja: 様々なアップルイベントデータ型が、Apple Event Managerで定義されます。

source: Apple uses bundles to represent apps, frameworks, plug-ins, and many other specific types of content.
ja: Appleはバンドルを使って、アプリ、フレームワーク、プラグイン、そして多くの他の特定の型のコンテンツを表現します。

source: Apple-provided concrete NSDimension subclasses
ja: Apple提供の具体的なNSDimensionサブクラス

source: Applications based on the Application Kit framework should let AppKit manage the suspension of notification delivery.
ja: Application Kitフレームワークに基づくアプリケーションは、AppKitに通知配達を管理させるべきです。

source: Applies a rotation factor (measured in degrees) to the receiver’s transformation matrix.
ja: 回転因数（度数で計られた）をレシーバの変換行列に適用します。

source: Applies a rotation factor (measured in radians) to the receiver’s transformation matrix.
ja: 回転因数（ラジアンで計られる）をレシーバの変換行列に適用します。

source: Applies scaling factors to each axis of the receiver’s transformation matrix.
ja: 拡大縮小因数をレシーバの変換行列の各軸に適用します。

source: Applies the receiver’s transform to the specified point and returns the result.
ja: レシーバの持つ変換を指定された点に適用して、結果を返します。

source: Applies the receiver’s transform to the specified size and returns the results.
ja: レシーバの持つ変換を指定されたサイズに適用して、結果を返します。

source: Applies the specified scaling factor along both x and y axes to the receiver’s transformation matrix.
ja: 指定された拡大縮小因数をxとy軸の両方に沿ってレシーバの変換行列に適用します。

source: Applies the specified translation factors to the receiver’s transformation matrix.
ja: 指定された変換因数をレシーバの変換行列に適用します。

source: Arbitrary data that is passed to observer in observe Value(for Key Path: of: change: context:).
ja: observe Value(for Key Path: of: change: context:)においてobserverに渡される随意のデータ。

source: Archives a given object along with all the objects to which it is connected.
ja: 与えられたオブジェクトだけでなくそれに接続される全てのオブジェクトも一緒にアーカイブします。

source: Archives and Serialization
ja: アーカイブとシリアライゼーション

source: Archiving
ja: アーカイブ

source: As a convenience, NSDictionary provides a set of methods (declared as a category in NSFile Manager .h) for quickly and efficiently obtaining attribute information from the returned dictionary: file Group Owner Account Name(), file Modification Date(), file Owner Account Name(), file Posix Permissions(), file Size(), file System File Number(), file System Number(), and file Type().
ja: ひとつの便宜として、NSDictionaryは一揃いのメソッド（NSFile Manager .hの中のあるカテゴリとして宣言される）を返される辞書から属性情報を素早く効率的に取得するために提供します：file Group Owner Account Name(), file Modification Date(), file Owner Account Name(), file Posix Permissions(), file Size(), file System File Number(), file System Number(), そして file Type()。

source: As a convenience, NSDictionary provides a set of methods (declared as a category on NSDictionary) for quickly and efficiently obtaining attribute information from the returned dictionary: file Group Owner Account Name(), file Modification Date(), file Owner Account Name(), file Posix Permissions(), file Size(), file System File Number(), file System Number(), and file Type().
ja: ひとつの便宜として、NSDictionaryは一揃いのメソッド（NSDictionary上のあるカテゴリとして宣言される）を返される辞書から属性情報を素早く効率的に取得するために提供します：file Group Owner Account Name(), file Modification Date(), file Owner Account Name(), file Posix Permissions(), file Size(), file System File Number(), file System Number(), そして file Type()。

source: As a result of this the icon, and set Icon: methods have moved to a new category of File Wrapper that remains in Application Kit.
ja: この結果としてicon、そしてset Icon:メソッドは、Application KitのままであるFile Wrapperの新しいカテゴリに移動しました。

source: As a rule, cookies are shared among all applications and are kept in sync across process boundaries.
ja: 原則として、クッキーはすべてのアプリケーションの間で共有されます、そしてプロセス境界を越えて同期され続けます。

source: As a side effect of code loading, the receiver posts did Load Notification after all classes and categories have been loaded; see Notifications for details.
ja: コードをロードする副作用として、レシーバは全てのクラスとカテゴリがロードされた後にdid Load Notificationを投函します；詳細としてNotificationsを見てください。

source: As an example, in the Gregorian calendar the maximum range of values for the Day component is 1-31.
ja: 一例として、グレゴリオ暦において「日」構成要素に対する値の最大範囲は1-31です。

source: As an example, in the Gregorian calendar the minimum range of values for the Day component is 1-28.
ja: 一例として、グレゴリオ暦において「日」構成要素に対する値の最小範囲は1-28です。

source: As an example, you would implement this method if you want the dollar signs in displayed strings removed for editing.
ja: 一例として、あなたが表示文字列でのドル符号を編集作業のため除去したいならば、あなたはこのメソッドを実装するでしょう。

source: As an optimization, you can use the bundle With Path: or bundle With URL: method instead to avoid file system traversal.
ja: １つの最適化として、あなたはbundle With Path:またはbundle With URL:メソッドを代わりに使って、ファイルシステムをあちこち見ていくのを回避できます。

source: As described in Working with Custom Units, you only need to create a custom subclass of NSDimension if a unit of the desired dimension is not yet defined.
ja: Working with Custom Unitsで記述されるように、望んだ寸法の単位がまだ定義されないならば、あなたはNSDimensionのあつらえのサブクラスを作成すればいいだけです。

source: As in macOS, the system creates the directory when you need it.
ja: macOSでのように、システムはディレクトリをあなたがそれを必要とする時に作成します。

source: As in the POSIX standard, the app either must own the file or directory or must be running as superuser for attribute changes to take effect.
ja: POSIX標準でのように、アプリは、ファイルまたはディレクトリを所有しなければならないかスーパーユーザとして実行していなければならないか属性変更が効果を持つにはどちらかです。

source: As long as all of its properties are Codable, any custom type can also be Codable.
ja: それのプロパティの全てがCodableである限り、あらゆるあつらえの型もまたCodableです。

source: As of iOS 10, macOS 10.12, tvOS 10, and watchOS 3, Foundation provides the Measurement Formatter class, which can be used to represent quantities of Unit Energy to provide equivalent functionality to Energy Formatter.
ja: iOS 10、macOS 10.12、tvOS 10、そしてwatchOS 3の時点で、FoundationはMeasurement Formatterクラスを提供します、それはUnit Energyの量を表現するために使用されて、Energy Formatterに等しい機能性を提供できます。

source: As of iOS 8.0 and macOS 10.10 The url must specify a flat file, not a bundle.
ja: iOS 8.0とmacOS 10.10現在、urlはフラットファイルを指定しなければなりません、バンドルではなく。

source: As part of its normal run loop processing, the main thread dequeues the message (assuming it is running in one of the common run loop modes) and invokes the desired method.
ja: それの標準的な実行ループ処理の一部として、メインスレッドはメッセージを（それが通常の実行ループモードの１つで実行されていると仮定して）デキューして、要望されたメソッドを発動します。

source: As part of its normal run loop processing, the main thread dequeues the message (assuming it is running in one of the specified modes) and invokes the desired method.
ja: それの標準的な実行ループ処理の一部として、メインスレッドはメッセージを（それが指定されたモードの１つで実行されていると仮定して）デキューして、要望されたメソッドを発動します。

source: As part of its normal run loop processing, the target thread dequeues the message (assuming it is running in one of the default run loop modes) and invokes the desired method.
ja: それの標準的な実行ループ処理の一部として、目標のスレッドはメッセージを（それが省略時の実行ループモードの１つで実行されていると仮定して）デキューして、要望されたメソッドを発動します。

source: As part of its normal run loop processing, the target thread dequeues the message (assuming it is running in one of the specified modes) and invokes the desired method.
ja: それの標準的な実行ループ処理の一部として、目標のスレッドはメッセージを（それが指定された実行ループモードの１つで実行されていると仮定して）デキューして、要望されたメソッドを発動します。

source: As such, complex regular expression patterns containing multiple * or + operators may result in poor performance when attempting to perform matches — particularly failing to match a given input.
ja: そういうことで、*や+演算子を含む複雑な正規表現式は、マッチ実行を試みようとすれば — とりわけ与えられた入力にマッチするのに失敗すれば、貧弱な性能という結果になります。

source: As with any guessing, it may get the result date wrong (that is, a date other than that which was intended).
ja: あらゆる推論と同様に、それは間違った結果日付を得るかもしれません（すなわち、意図されたもの以外の日付）。

source: Asks the delegate if a hard link should be created between the items at the two URLs.
ja: ２つのURLでの項目間にハードリンクが作成されるべきか、委任先に尋ねます。

source: Asks the delegate if a hard link should be created between the items at the two paths.
ja: ２つのパスでの項目間にハードリンクが作成されるべきか、委任先に尋ねます。

source: Asks the delegate if the file manager should copy the specified item to the new URL.
ja: ファイルマネージが指定された項目を新しいURLへコピーするべきか、委任先に尋ねます。

source: Asks the delegate if the file manager should copy the specified item to the new path.
ja: ファイルマネージが指定された項目を新しいパスへコピーするべきか、委任先に尋ねます。

source: Asks the delegate if the file manager should move the specified item to the new URL.
ja: ファイルマネージが指定された項目を新しいURLへ移動するべきか、委任先に尋ねます。

source: Asks the delegate if the file manager should move the specified item to the new path.
ja: ファイルマネージが指定された項目を新しいパスへ移動するべきか、委任先に尋ねます。

source: Asks the delegate if the move operation should continue after an error occurs while copying the item at the specified URL.
ja: 指定されたURLで項目をコピーしている間にエラーが発生する後で、移動操作は続行するべきか、委任先に尋ねます。

source: Asks the delegate if the move operation should continue after an error occurs while copying the item at the specified path.
ja: 指定されたパスで項目をコピーしている間にエラーが発生する後で、移動操作は続行するべきか、委任先に尋ねます。

source: Asks the delegate if the move operation should continue after an error occurs while moving the item at the specified URL.
ja: 指定されたURLで項目を移動している間にエラーが発生する後で、移動操作は続行するべきか、委任先に尋ねます。

source: Asks the delegate if the move operation should continue after an error occurs while moving the item at the specified path.
ja: 指定されたパスで項目を移動している間にエラーが発生する後で、移動操作は続行するべきか、委任先に尋ねます。

source: Asks the delegate if the operation should continue after an error occurs while linking to the item at the specified URL.
ja: 指定されたURLで項目をリンクしている間にエラーが発生する後で、操作は続行するべきか、委任先に尋ねます。

source: Asks the delegate if the operation should continue after an error occurs while linking to the item at the specified path.
ja: 指定されたパスで項目をリンクしている間にエラーが発生する後で、操作は続行するべきか、委任先に尋ねます。

source: Asks the delegate if the operation should continue after an error occurs while removing the item at the specified URL.
ja: 指定されたURLで項目を移動している間にエラーが発生する後で、操作は続行するべきか、委任先に尋ねます。

source: Asks the delegate if the operation should continue after an error occurs while removing the item at the specified path.
ja: 指定されたパスで項目を移動している間にエラーが発生する後で、操作は続行するべきか、委任先に尋ねます。

source: Asks the delegate whether the item at the specified URL should be deleted.
ja: 指定されたURLでの項目が削除されるべきかどうか、委任先に尋ねます。

source: Asks the delegate whether the item at the specified path should be deleted.
ja: 指定されたパスでの項目が削除されるべきかどうか、委任先に尋ねます。

source: Assertions
ja: アサーション

source: Assigning a valid Block object to this property creates a dispatch source for reading the contents of the file or socket.
ja: 有効なBlockオブジェクトをこのプロパティに割り当てることは、ファイルまたはソケットの内容を読み込むことに対するディスパッチソースを作成します。

source: Assigning a valid Block object to this property creates a dispatch source for writing the contents of the file or socket.
ja: 有効なBlockオブジェクトをこのプロパティに割り当てることは、ファイルまたはソケットの内容を書き出すためのディスパッチソースを作成します。

source: Assigning any other calendar units to this property results in an exception.
ja: 何らかの他のカレンダー単位をこのプロパティに割り当てることは、例外という結果になります。

source: Associated Type
ja: 関連型

source: Associated Types
ja: 関連型

source: Assuming an Array exists, a sorted version of the array can be created in this way:
ja: an Arrayがあると仮定して、その配列のソートされたバージョンはこの方法で作成されることができます：

source: Asynchronously checks to see if data is available.
ja: データが利用可能かどうかを知るために非同期的に調べます。

source: At least one of the sequences must be finite.
ja: 少なくともシーケンスのうちの一方は有限でなければなりません。

source: Atomic-match parentheses.
ja: 不可分マッチの括弧。

source: Attachments
ja: 付加情報

source: Attempting to access an element by using an index outside the bounds of the slice’s indices may result in a runtime error, even if that index is valid for the original collection.
ja: ある要素にスライスのもつインデックスの境界外のインデックスを使ってアクセスを試みることは、実行時エラーという結果になるでしょう、たとえそのインデックスが元々のコレクションに対して有効であるとしてもです。

source: Attempting to call this method by passing original Item URL and new Item URL parameters that have locations on different volumes results in an error.
ja: このメソッドを異なるボリューム上に位置するoriginal Item URLとnew Item URLパラメータを渡すことによって呼び出す試みは、エラーという結果になります。

source: Attempting to predicate behavior based on the current state of the file system or a particular file on the file system is not recommended.
ja: 現在のファイルシステムまたはファイルシステム上の特定のファイルの現在の状態に基づいて挙動を断定する試みは、推奨されません。

source: Attempting to remove more elements than exist in the collection triggers a runtime error.
ja: コレクションの中に存在するより多くの要素の除去を試みることは実行時エラーの引き金となります。

source: Attempting to remove the same shipping option a second time results in nil, because options no longer contains .priority as a member.
ja: 同じ出荷オプションの除去を２回目に試みることはnilという結果になります、optionsはもはや.priorityをメンバとして含まないからです。

source: Attempts to read or write a closed file descriptor raise an exception.
ja: 閉じられたファイル記述子での読み込みや書き出しの試みは、例外を引き起こします。

source: Availability
ja: 有効性

source: Avoid assigning a delegate to the shared file manager obtained from the default method.
ja: 委任先をdefaultメソッドから取得される共有ファイルマネージャに割り当てることは避けてください。

source: Avoid calling this method from your app’s main thread.
ja: このメソッドをあなたのアプリのメインスレッドから呼び出すことを避けてください。

source: Back Reference.
ja: 前方参照。

source: Backslash escaping in substitution text is only required for '$' and '\', but may be used on any other character without bad effects.
ja: 置換テキストにおいてバックスラッシュ・エスケープは『$』と『\』のために必要であるだけです、しかし悪い効果なしに他のどの文字についても使われることができます。

source: Backslash will escape both $ and \.
ja: バックスラッシュは、$と\をエスケープします。

source: Base unit
ja: 基本単位

source: Base-64 Encoding
ja: Base-64エンコーディング

source: Base-64, UTF-8 encoded input data.
ja: Base-64、UTF-8エンコードされた入力データ。

source: Base64 Decoding
ja: Base64をデコードする

source: Base64 Encoding
ja: Base64エンコーディング
